#+STARTTIP: overview

* modes
#+BEGIN_SRC emacs-lisp
  (scroll-bar-mode 0)  
  (global-visual-line-mode t)
  (diminish 'visual-line-mode)
  (diminish 'eldoc-mode)
  (global-hl-line-mode t)
  (electric-pair-mode 1)
  (show-paren-mode 1) 
  (set-face-attribute 'default nil :height 110)
  (pending-delete-mode 1)

  ;;save outside clipboard to kill ring
  (setq save-interprogram-paste-before-kill t)


  ;;linum-mode hooks
  (add-hook 'emacs-lisp-mode-hook 'linum-mode)
  (add-hook 'sh-mode-hook 'linum-mode)




  ;;evaluate and replace
  (defun eval-and-replace ()
	"Replace the preceding sexp with its value."
	(interactive)
	(backward-kill-sexp)
	(condition-case nil
		(prin1 (eval (read (current-kill 0)))
			   (current-buffer))
	  (error (message "Invalid expression")
			 (insert (current-kill 0)))))
  (global-set-key (kbd "C-x M-e") 'eval-and-replace)


  ;;open config
  (define-key global-map (kbd "\e\ec")  (lambda () (interactive) (find-file "~/.emacs.d/myinit.org")))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (find-file ~/.emacs.d/myinit.org) |

* auctex
#+BEGIN_SRC emacs-lisp :results output silent 
  (use-package tex-site
	;; AuCTeX is better than the built in tex mode; let's use it.  This
	;; demand adds almost nothing and ensures that auctex gets to set itself
	;; up properly. That's necessary because of how weirdly it gets loaded.
	:ensure auctex
	:demand t
	:custom
	(TeX-auto-save t)
	;;(TeX-electric-escape t)
	(TeX-electric-math '("\\(" . "\\)") "Smart $ behavior")
	(TeX-electric-sub-and-superscript t)
	(TeX-parse-self t)
	(reftex-plug-into-AUCTeX t)
	;;(setq font-latex-fontify-script nil) ;; stop changing position of stuff on lines
	(TeX-source-correlate-method 'synctex)
	(TeX-source-correlate-mode t)
	(TeX-clean-confirm nil)
	;; TeX-command-list by default contains a bunch of stuff I'll never
	;; use. I use latexmk, xelatexmk, and View.  That's pretty much it.
	;; Maybe one day I'll add "clean" back to the list.
	;; (TeX-command-list
	;;  '(("latexmk" "latexmk -synctex=1 -quiet -pdf %s"
	;;     TeX-run-compile nil t :help "Process file with latexmk")
	;;    ("View" "%V" TeX-run-discard-or-function nil t :help "Run Viewer")
	;;    ("xelatexmk" "latexmk -synctex=1 -quiet -xelatex %s"
	;;     TeX-run-compile nil t :help "Process file with xelatexmk")))
	:hook
	(LaTeX-mode . LaTeX-math-mode)
	(LaTeX-mode . reftex-mode)
	(LaTeX-mode . TeX-PDF-mode)
	(LaTeX-mode . (lambda ()
					(push
					 '("Make" "latexmk -outdir=/tmp %t" TeX-run-TeX nil t
					   :help "Make pdf output using latexmk.")
					 TeX-command-list)))
	:config
	(setq-default TeX-command-default "latexmk")
	;; revert pdf from file after compilation finishes
	(use-package tex-buf
	  :config
	  (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer))
	(use-package latex
	  :bind
	  (:map LaTeX-mode-map
			("M-p" . outline-previous-visible-heading)
			("M-n" . outline-next-visible-heading)
			("<backtab>" . org-cycle))
	  :config
	  (push "\\.fdb_latexmk" LaTeX-clean-intermediate-suffixes)
	  (push "\\.fls" LaTeX-clean-intermediate-suffixes)
	  (push "\\.synctex.gz" LaTeX-clean-intermediate-suffixes)))
#+END_SRC

#+RESULTS:
| japanese-latex-mode-initialization | er/add-latex-mode-expansions | (lambda nil (push '(Make latexmk -outdir=/tmp %t TeX-run-TeX nil t :help Make pdf output using latexmk.) TeX-command-list)) | preview-mode-setup | (lambda nil (setq TeX-command-list (cons '(Make latexmk -outdir=/tmp %t TeX-run-TeX nil t :help Make pdf output using latexmk.) TeX-command-list))) | TeX-PDF-mode | reftex-mode | LaTeX-math-mode | turn-on-cdlatex |

* cdlatex
#+BEGIN_SRC emacs-lisp
  (use-package cdlatex
	:ensure t
	:hook ((LaTeX-mode . turn-on-cdlatex)
		   ;;(org-mode . turn-on-cdlatex)
)
	)
#+END_SRC

#+RESULTS:
| preview-mode-setup | er/add-latex-mode-expansions | turn-on-cdlatex | (lambda nil (setq TeX-command-list (cons '(Make latexmk -outdir=/tmp %t TeX-run-TeX nil t :help Make pdf output using latexmk.) TeX-command-list))) | TeX-PDF-mode | reftex-mode | LaTeX-math-mode |

* flycheck
#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :ensure t
    :init (global-flycheck-mode)
    :config 
	:diminish "FlyC"
    ;;(setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc))
	;;:diminish
    )
#+END_SRC

#+RESULTS:
| FlyC |
|      |
* flyspell
#+BEGIN_SRC emacs-lisp
  (use-package flyspell
  :ensure t
  :diminish "FlyS")
#+END_SRC

#+RESULTS:
| FlyS |

* gradle
#+BEGIN_SRC emacs-lisp
  (use-package gradle-mode
	:ensure t
	:hook (java-mode . (lambda() (gradle-mode 1))))

  ;; (defun build-and-run (&optional CLASS-NAME)
  ;;   "Get class name from buffer."
  ;;   (interactive "sClass to run (default current buffer): ")
  ;;   (gradle-run (concat "build run -Pmain=" (or CLASS-NAME (file-name-base (buffer-file-name (window-buffer (minibuffer-selected-window))))))))

  (cl-defun build-and-run (&optional CLASS-NAME &key (CLASS-NAME (file-name-base (buffer-file-name (window-buffer (minibuffer-selected-window))))))
	(interactive "sClass to run (default current buffer): ")
	(save-buffer)
	(gradle-run (concat "build run -q -Pmain=" CLASS-NAME)))

  (define-key gradle-mode-map (kbd "C-c C-r") 'build-and-run)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
  (use-package groovy-mode
    :ensure t
    :hook (//.gradle// . groovy-mode))
#+END_SRC

#+RESULTS:
| groovy-mode |

* meghanada
#+BEGIN_SRC emacs-lisp
  ;; (use-package meghanada
  ;;   :ensure t
  ;;   :init
  ;;   (setq meghanada-gradle-path "gradle")
  ;;   :bind
  ;;   (:map meghanada-mode-map
  ;;         (("C-M-o" . meghanada-optimize-import)
  ;;          ("C-M-t" . meghanada-import-all)
  ;;          )))
  ;; (defun tkj-java-meghanda-mode-hook ()
  ;;   (meghanada-mode)
  ;;   (flycheck-mode))
  ;; (add-hook 'java-mode-hook 'tkj-java-meghanda-mode-hook)
#+END_SRC

#+RESULTS:
| tkj-java-meghanda-mode-hook | (lambda nil (gradle-mode 1)) |

* pdf-tools
#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools
	;; I like emacs, so why not view PDFs in it?  The built-in docview mode
	;; can do so, but pdf-tools is better in all sorts of ways.

	;; NOTE: ~pdf-tools~ only officially supports gnu/linux operating
	;; systems. I think that it will work on macs as well, but you may have
	;; to finagle it a bit. Regardless, I tell emacs to only use it if the OS
	;; is linux based.
	:if (eq system-type 'gnu/linux)
	:ensure t
	:magic ("%PDF" . pdf-view-mode)
	:defer 7
	:custom
	(pdf-sync-forward-display-pdf-key "<C-return>" "Use C-RET in latex mode to jump to location in pdf file")
	(pdf-view-display-size 'fit-page "Show full pages by default instead of fitting page width.")
	(TeX-view-program-selection '((output-pdf "pdf-tools")) "Use pdf-tools to display pdfs from latex runs.")
	(TeX-view-program-list '(("pdf-tools" "TeX-pdf-tools-sync-view")))
	:config
	;; The t says to install the server without asking me --- this may take a
	;; second
	(pdf-tools-install t))
#+END_SRC

#+RESULTS:
: ((!#[ \t]*/.*[jp]ython[0-9.]* . python-mode) (%PDF . pdf-view-mode))

* Undo Tree
#+BEGIN_SRC emacs-lisp
  (use-package undo-tree
	:ensure t
	:init (global-undo-tree-mode)
	:diminish
	)
#+END_SRC

#+RESULTS:
|   |

* multiple cursors
#+BEGIN_SRC emacs-lisp
  ;;get rid of nasty secondary selection keybindings
  (delete-overlay mouse-secondary-overlay)
  (global-unset-key [M-mouse-1])
  (global-unset-key [M-drag-mouse-1])
  (global-unset-key [M-down-mouse-1])
  (global-unset-key [M-mouse-3])
  (global-unset-key [M-mouse-2])

  (use-package multiple-cursors
    :ensure t
    )

  ;;sets return to enter new line rather than exit multiple cursors
  (define-key mc/keymap (kbd "<return>") nil)


  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)

  (global-set-key
   (kbd "C-c m c")
   (defhydra multiple-cursors-hydra (:hint nil)
     "
           ^Up^            ^Down^        ^Other^
      ----------------------------------------------
      [_p_]   Next    [_n_]   Next    [_l_] Edit lines
      [_P_]   Skip    [_N_]   Skip    [_a_] Mark all
      [_M-p_] Unmark  [_M-n_] Unmark  [_r_] Mark by regexp
      ^ ^             ^ ^             [_q_] Quit
      "
     ("l" mc/edit-lines :exit t)
     ("a" mc/mark-all-like-this :exit t)
     ("n" mc/mark-next-like-this)
     ("N" mc/skip-to-next-like-this)
     ("M-n" mc/unmark-next-like-this)
     ("p" mc/mark-previous-like-this)
     ("P" mc/skip-to-previous-like-this)
     ("M-p" mc/unmark-previous-like-this)
     ("r" mc/mark-all-in-region-regexp :exit t)
     ("q" nil)
     ("<mouse-1>" mc/add-cursor-on-click)
     ("<down-mouse-1>" ignore)
     ("<drag-mouse-1>" ignore)))

#+END_SRC

#+RESULTS:
=multiple-cursors-hydra/body
=* plantuml
#+BEGIN_SRC emacs-lisp
  (use-package plantuml-mode
	:ensure t
	:config
	(add-to-list 'auto-mode-alist '("\\.plantuml\\'" . plantuml-mode))
	)
#+END_SRC

#+RESULTS:
: t

* custom lisp
#+BEGIN_SRC emacs-lisp
  (defun load-directory (dir)
    (let ((load-it (lambda (f)
                     (load-file (concat (file-name-as-directory dir) f)))
                   ))
      (mapc load-it (directory-files dir nil "\\.el$"))))
  (load-directory "~/.emacs.d/nhh-lisp")

  (if (string-equal system-name "nick-laptop")
      (setq powerline-height 30)
    (string-equal system-name "nick-pc")
    (setq powerline-height 20)
    (set-face-attribute 'default nil :height 130)
    )


  (load-theme 'zenburn)
  (powerline-reset)
#+END_SRC

#+RESULTS:
| mode-line.el | set-theme.el |
* terminal

#+BEGIN_SRC emacs-lisp
  (add-hook 'eshell-mode-hook (lambda ()
                                (setq-local global-hl-line-mode
                                            nil)))
  (add-hook 'term-mode-hook (lambda ()
                              (setq-local global-hl-line-mode
                                          nil)))
#+END_SRC

#+RESULTS:
| lambda | nil | (setq-local global-hl-line-mode nil) |

